const fs = require('fs');

fs.readFile(`${__dirname}/sms.json`, 'utf8', (err, data) => {
  if (err) {
    console.error('Error reading file:', err);
    return;
  }
  try {
    const jsonObject = JSON.parse(data);
    for (let i = 0; i < jsonObject.length; i++) {
      // 【验证码关键字】
      // (?<!回复|回覆|获取|獲取)((验证|授权|校验|检验|确认|激活|动态|安全|登入|认证|识别|交易|短信|授权|随机|一次性)(代?码|口令|密码|编码)|(驗證|授權|校驗|檢驗|確認|激活|動態|安全|登入|認證|識別|交易|短信|授權|隨機|一次性)(代?碼|口令|密碼|編碼)|([Vv]erification|[Vv]alidation|[Ss]ecurity)? ?[Cc]ode)

      // 【验证码正则】两种情况，验证码在【验证码关键字】后，验证码在【验证码关键字】前
      // (?<!(联系|聯繫|结尾|結尾|尾号|尾號|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))

      // 验证码位置：两种情况，验证码在【验证码关键字】后，验证码在【验证码关键字】前
      // (?<=(【验证码关键字】)[\s\S]{0,60})【验证码正则】
      // 【验证码正则】(?=[\s\S]{0,60}(【验证码关键字】))

      // 两种位置均需匹配：通过｜组合到一起
      // (?<=(【验证码关键字】)[\s\S]{0,60})【验证码正则】|【验证码正则】(?=[\s\S]{0,60}(【验证码关键字】))

      // 完整短信：添加首尾字符以匹配完整短信
      // ([\s\S]*?)((?<=(【验证码关键字】)[\s\S]{0,60})【验证码正则】|【验证码正则】(?=[\s\S]{0,60}(【验证码关键字】)))([\s\S]*)

      // 完整短信：【验证码正则】替换为对应内容
      // ([\s\S]*?)((?<=(【验证码关键字】)[\s\S]{0,60})(?<!(联系|聯繫|结尾|結尾|尾号|尾號|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))|(?<!(联系|聯繫|结尾|結尾|尾号|尾號|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))(?=[\s\S]{0,60}(【验证码关键字】)))([\s\S]*)

      // 完整短信：【验证码关键字】替换为对应内容
      // ([\s\S]*?)((?<=((?<!回复|回覆|获取|獲取)((验证|授权|校验|检验|确认|激活|动态|安全|登入|认证|识别|交易|短信|授权|随机|一次性)(代?码|口令|密码|编码)|(驗證|授權|校驗|檢驗|確認|激活|動態|安全|登入|認證|識別|交易|短信|授權|隨機|一次性)(代?碼|口令|密碼|編碼)|([Vv]erification|[Vv]alidation|[Ss]ecurity)? ?[Cc]ode))[\s\S]{0,60})(?<!(联系|聯繫|结尾|結尾|尾号|尾號|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))|(?<!(联系|聯繫|结尾|結尾|尾号|尾號|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))(?=[\s\S]{0,60}((?<!回复|回覆|获取|獲取)((验证|授权|校验|检验|确认|激活|动态|安全|登入|认证|识别|交易|短信|授权|随机|一次性)(代?码|口令|密码|编码)|(驗證|授權|校驗|檢驗|確認|激活|動態|安全|登入|認證|識別|交易|短信|授權|隨機|一次性)(代?碼|口令|密碼|編碼)|([Vv]erification|[Vv]alidation|[Ss]ecurity)? ?[Cc]ode))))([\s\S]*)

      const regex = /([\s\S]*?)((?<=((?<!回复|回覆|获取|獲取)((验证|授权|校验|检验|确认|激活|动态|安全|登入|认证|识别|交易|短信|授权|随机|一次性)(代?码|口令|密码|编码)|(驗證|授權|校驗|檢驗|確認|激活|動態|安全|登入|認證|識別|交易|短信|授權|隨機|一次性)(代?碼|口令|密碼|編碼)|([Vv]erification|[Vv]alidation|[Ss]ecurity)? ?[Cc]ode))[\s\S]{0,60})(?<!(联系|聯繫|结尾|結尾|尾号|尾號|尾4位|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))|(?<!(联系|聯繫|结尾|結尾|尾号|尾號|尾4位|ending |[A-Za-z0-9]))([0-9-]{4,8})(?![A-Za-z0-9]|\]?(-| -))(?=[\s\S]{0,60}((?<!回复|回覆|获取|獲取)((验证|授权|校验|检验|确认|激活|动态|安全|登入|认证|识别|交易|短信|授权|随机|一次性)(代?码|口令|密码|编码)|(驗證|授權|校驗|檢驗|確認|激活|動態|安全|登入|認證|識別|交易|短信|授權|隨機|一次性)(代?碼|口令|密碼|編碼)|([Vv]erification|[Vv]alidation|[Ss]ecurity)? ?[Cc]ode))))([\s\S]*)/gm;
      
      const text = jsonObject[i]["text"]
      const code = jsonObject[i]["code"]
      let fiter_code = regex.exec(text)
      if (fiter_code) {
        if (code != fiter_code[2]) {
          console.log(text)
          // console.log(JSON.stringify(fiter_code))
          console.log(fiter_code[2])
          console.log("")
        }
      } else {
        console.log(text)
        console.log("Nothing found\n")
      }
    }
  } catch (parseErr) {
    console.error('Error parsing JSON:', parseErr);
  }
});